#+title: Day17

** Compilation and Execution
- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_type_struct.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_type_struct.c -o mpi_type_struct.out
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_type_struct.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_type_struct.out 2
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 2 ./mpi_type_struct.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Process 0 sent struct: {a = 42, b = 3.14, c = A}
  Process 1 received struct: {a = 42, b = 3.14, c = A}

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

This example demonstrates how to use `MPI_Type_create_struct` to communicate complex data structures in MPI.
** Compilation and Execution
- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_type_struct2.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_type_struct2.c -o mpi_type_struct2.out
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_type_struct2.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_type_struct2.out 2
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 2 ./mpi_type_struct2.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Process 0 has struct: {arr = [1, 2, 3], b = 3.14, c = A}
  Process 1 received struct: {arr = [1, 2, 0], b = 3.14, c = A}

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

This example demonstrates how to use `MPI_Type_create_struct` to communicate complex data structures in MPI, specifically how to send parts of an array along with other fields.

** Compilation and Execution
- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh task1.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc task1.c -o task1.out
  : ------------------------------------------------------------------
  : Compilation successful. Check at task1.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./task1.out 2
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 2 ./task1.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Process 0 send data:
  Name : Abhishek Raj
  PRN : 1
  Age : 24
  Email : abhi@abhi.com
  Salary : 10000.011111
  Marks : 40 39 40 40 38
  Process 1 received data:
  Name : Abhishek Raj
  PRN : 1
  Age : 24
  Email : abhi@abhi.com
  Salary : 10000.011111
  Marks : 40 39 40 40 38

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

** Compilation and Execution
- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_pack_unpack.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_pack_unpack.c -o mpi_pack_unpack.out
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_pack_unpack.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_pack_unpack.out 2
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 2 ./mpi_pack_unpack.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Process 0 sent packed data
  Process 1 received unpacked data: {a = 42, b = 3.14, c = A}

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

This example demonstrates how to use `MPI_Pack` and `MPI_Unpack` to communicate complex data structures in MPI.

*** Example
Let's calculate the buffer size for packing an integer, a double, and a char.

#+BEGIN_SRC C :tangle mpi_pack_size.c
#include <mpi.h>
#include <stdio.h>

int main(int argc, char** argv) {
    MPI_Init(&argc, &argv);

    int size_int, size_double, size_char, total_size;
    MPI_Pack_size(1, MPI_INT, MPI_COMM_WORLD, &size_int);
    MPI_Pack_size(1, MPI_DOUBLE, MPI_COMM_WORLD, &size_double);
    MPI_Pack_size(1, MPI_CHAR, MPI_COMM_WORLD, &size_char);

    total_size = size_int + size_double + size_char;
    printf("Buffer size required for packing: %d bytes\n", total_size);

    MPI_Finalize();
    return 0;
}
#+END_SRC

- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_pack_size.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_pack_size.c -o mpi_pack_size.out
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_pack_size.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_pack_size.out 2
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 2 ./mpi_pack_size.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Buffer size required for packing: 13 bytes
  Buffer size required for packing: 13 bytes

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

** Compilation and Execution
- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_probe_get_count.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_probe_get_count.c -o mpi_probe_get_count.out
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_probe_get_count.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_probe_get_count.out 2
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 2 ./mpi_probe_get_count.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Process 0 sent data to process 1
  Process 1 received 5 integers:
  1 2 3 4 5

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

* Task
#+BEGIN_SRC C :tangle mpi_any_src_and_tag.c
#include <mpi.h>
#include <stdio.h>
#include <stdlib.h>
#include <stddef.h>

int main(int argc, char** argv) {
    MPI_Init(&argc, &argv);

    int rank, size;
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);

    if (size < 2) {
        fprintf(stderr, "World size must be greater than 1 for this example\n");
        MPI_Abort(MPI_COMM_WORLD, 1);
    }

    if (rank != 0) {
        MPI_Send(&rank, 1, MPI_INT, 0, 0, MPI_COMM_WORLD);
    } else {
        int data = 0;
        MPI_Recv(&data, 1, MPI_INT, MPI_ANY_SOURCE, MPI_ANY_TAG, MPI_COMM_WORLD, MPI_STATUS_IGNORE);
        printf("I have received message from process %d\n", data);
    }

    MPI_Finalize();
    return 0;
}
#+END_SRC

#+begin_src bash :results output :exports both
bash compile.sh mpi_any_src_and_tag.c
#+end_src

#+RESULTS:
: ------------------------------------------------------------------
: Command executed: mpicc mpi_any_src_and_tag.c -o mpi_any_src_and_tag.out
: ------------------------------------------------------------------
: Compilation successful. Check at mpi_any_src_and_tag.out
: ------------------------------------------------------------------

#+begin_src bash :results output :exports both
bash run.sh ./mpi_any_src_and_tag.out 10
#+end_src

#+RESULTS:
#+begin_example
------------------------------------------------------------------
Command executed: mpirun -np 10 ./mpi_any_src_and_tag.out
------------------------------------------------------------------
##################################################################
##########                    OUTPUT                    ##########
##################################################################

I have received message from process 5

##################################################################
##########                     DONE                     ##########
##################################################################
#+end_example

* Task v2
#+BEGIN_SRC C :tangle mpi_any_src_and_tag2.c
#include <mpi.h>
#include <stdio.h>
#include <stdlib.h>
#include <stddef.h>

int main(int argc, char** argv) {
    MPI_Init(&argc, &argv);

    int rank, size;
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);

    if (size < 2) {
        fprintf(stderr, "World size must be greater than 1 for this example\n");
        MPI_Abort(MPI_COMM_WORLD, 1);
    }

    if (rank != 0) {
        int data = 100;
        MPI_Send(&data, 1, MPI_INT, 0, 0, MPI_COMM_WORLD);
    } else {
        MPI_Status status;
        int data = 0;
        MPI_Recv(&data, 1, MPI_INT, MPI_ANY_SOURCE, MPI_ANY_TAG, MPI_COMM_WORLD, &status);
        printf("I have received message from process %d\n", status.MPI_SOURCE);
    }

    MPI_Finalize();
    return 0;
}
#+END_SRC

#+begin_src bash :results output :exports both
bash compile.sh mpi_any_src_and_tag.c
#+end_src

#+RESULTS:
: ------------------------------------------------------------------
: Command executed: mpicc mpi_any_src_and_tag.c -o mpi_any_src_and_tag.out
: ------------------------------------------------------------------
: Compilation successful. Check at mpi_any_src_and_tag.out
: ------------------------------------------------------------------

#+begin_src bash :results output :exports both
bash run.sh ./mpi_any_src_and_tag.out 10
#+end_src

#+RESULTS:
#+begin_example
------------------------------------------------------------------
Command executed: mpirun -np 10 ./mpi_any_src_and_tag.out
------------------------------------------------------------------
##################################################################
##########                    OUTPUT                    ##########
##################################################################

I have received message from process 5

##################################################################
##########                     DONE                     ##########
##################################################################
#+end_example

** Compilation and Execution

- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_groups_communicators.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_groups_communicators.c -o mpi_groups_communicators.out
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_groups_communicators.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_groups_communicators.out 5
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 5 ./mpi_groups_communicators.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  World Rank: 0, New Rank: 0, New Size: 3
  World Rank: 0, New Comm Sum: 3
  World Rank: 1, New Rank: 0, New Size: 2
  World Rank: 1, New Comm Sum: 1
  World Rank: 3, New Rank: 1, New Size: 2
  World Rank: 3, New Comm Sum: 1
  World Rank: 4, New Rank: 2, New Size: 3
  World Rank: 4, New Comm Sum: 3
  World Rank: 2, New Rank: 1, New Size: 3
  World Rank: 2, New Comm Sum: 3

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example


This example demonstrates how to create and use groups and communicators in MPI to organize and manage process communication in parallel applications.
** Compilation and Execution

- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_task_parallelism_manual_groups.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_task_parallelism_manual_groups.c -o mpi_task_parallelism_manual_groups.out
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_task_parallelism_manual_groups.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_task_parallelism_manual_groups.out 9
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 9 ./mpi_task_parallelism_manual_groups.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Process 2 performing computation
  Process 6 performing computation
  Process 5 performing I/O operations
  Process 8 performing computation
  Process 1 performing I/O operations
  Process 4 performing computation
  Process 0 performing computation
  Process 3 performing I/O operations
  Process 7 performing I/O operations
  world rank 2 : new rank 1 : some of ranks : 10
  world rank 0 : new rank 0 : some of ranks : 10
  world rank 6 : new rank 3 : some of ranks : 10
  world rank 8 : new rank 4 : some of ranks : 10
  world rank 4 : new rank 2 : some of ranks : 10
  world rank 5 : new rank 2 : some of ranks : 6
  world rank 3 : new rank 1 : some of ranks : 6
  world rank 7 : new rank 3 : some of ranks : 6
  world rank 1 : new rank 0 : some of ranks : 6

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

** Compilation and Execution

- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_task_parallelism.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_task_parallelism.c -o mpi_task_parallelism.out -lm
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_task_parallelism.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_task_parallelism.out 10
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 10 ./mpi_task_parallelism.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Process 0 performing computation
  Process 1 performing I/O operations
  Process 8 performing computation
  Process 6 performing computation
  Process 4 performing computation
  Process 3 performing I/O operations
  Process 7 performing I/O operations
  Process 9 performing I/O operations
  Process 5 performing I/O operations
  Process 2 performing computation

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

* Task1
#+begin_src C :tangle taskp.c
#include <mpi.h>
#include <stdio.h>

long long sumOfSquares(long long *arr, int size){
    long long sum = 0;
    for(int i = 0; i < size; i++){
        sum+= arr[i] * arr[i];
    }
    return sum;
}

long long sum(long long *arr, int size){
    long long sum = 0;
    for(int i = 0; i < size; i++){
        sum+= arr[i];
    }
    return sum;
}


int main(int argc, char** argv) {
    MPI_Init(&argc, &argv);

    int rank, size;
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);

    // Split the world group into two groups
    int color = rank % 2;  // Determine color based on rank
    MPI_Comm new_comm;
    MPI_Comm_split(MPI_COMM_WORLD, color, rank, &new_comm);

    // Get the new rank and size in the new communicator
    int new_rank, new_size;
    MPI_Comm_rank(new_comm, &new_rank);
    MPI_Comm_size(new_comm, &new_size);

    //printf("World Rank: %d, New Rank: %d, New Size: %d\n", rank, new_rank, new_size);
    const int data_size = 10000;
    long long data[data_size];
    if(new_rank == 0){
        for(int i = 0; i < data_size; i++){
            data[i] = i + 1;
        }
    }
    //data broadcasted to each process in new_comm
    int chunk_size = data_size / new_size;
    long long local_array[chunk_size];
    long long local_sum = 0;
    long long local_square_sum = 0;
    MPI_Scatter(data, chunk_size, MPI_LONG_LONG, local_array, chunk_size, MPI_LONG_LONG, 0, new_comm);
    // Perform some communication within the new communicator
    if(color == 0){
        local_sum = sum(local_array, chunk_size);
    }
    if(color == 1){
        local_square_sum = sumOfSquares(local_array, chunk_size);
    }
    long long final_sum = 0;
    long long final_square_sum = 0;
    if(color == 0)
        MPI_Allreduce(&local_sum, &final_sum, 1, MPI_LONG_LONG, MPI_SUM, new_comm);
    else MPI_Allreduce(&local_square_sum, &final_square_sum, 1, MPI_LONG_LONG, MPI_SUM, new_comm);
    if(new_rank == 0){
        if(color == 0)
            printf("World Rank: %d, Sum of arrays: %lld\n", rank, final_sum);
        if(color == 1)
            printf("World Rank: %d, Sum of squares of arrays: %lld\n", rank, final_square_sum);
    }

    // Free the new communicator and group
    MPI_Comm_free(&new_comm);

    MPI_Finalize();
    return 0;
}
#+end_src

#+begin_src bash :results output :exports both
bash compile.sh taskp.c
#+end_src

#+RESULTS:
: ------------------------------------------------------------------
: Command executed: mpicc taskp.c -o taskp.out
: ------------------------------------------------------------------
: Compilation successful. Check at taskp.out
: ------------------------------------------------------------------

#+begin_src bash :results output :exports both
bash run.sh ./taskp.out 10
#+end_src

#+RESULTS:
#+begin_example
------------------------------------------------------------------
Command executed: mpirun -np 10 ./taskp.out
------------------------------------------------------------------
##################################################################
##########                    OUTPUT                    ##########
##################################################################

World Rank: 0, Sum of arrays: 50005000
World Rank: 1, Sum of squares of arrays: 333383335000

##################################################################
##########                     DONE                     ##########
##################################################################
#+end_example
